Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometry.GetGeometryEnumerator Method
 Gets a new geometry sections enumerator for enumerating through the geometry sections.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GeometrySectionEnumerator GetGeometryEnumerator()
Public Function GetGeometryEnumerator As GeometrySectionEnumerator
Return Value
Type: GeometrySectionEnumerator
The new geometry sections enumerator.
See Also
Reference
ConnectiveGeometry Class
Tekla.Structures.Model Namespace